In [2]:
import pandas as pd

In [3]:
data = {
    'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
    'year':[2000,2001,2002,2001,2002],
    'pop':[1.5,1.7,3.6,2.4,2.9]
}

df = pd.DataFrame(data)

In [4]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
df.dtypes

state     object
year       int64
pop      float64
dtype: object

In [6]:
df.columns

Index(['state', 'year', 'pop'], dtype='object')

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
df['year']

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [11]:
type(df['year'])

pandas.core.series.Series

In [13]:
df[['year','pop']]

   year  pop
0  2000  1.5
1  2001  1.7
2  2002  3.6
3  2001  2.4
4  2002  2.9

In [14]:
type(df[['year','pop']])

pandas.core.frame.DataFrame

check out rows

In [15]:
df.loc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [16]:
type(df.loc[1])

pandas.core.series.Series

check out multi lines, [1:3] start from 1 until 3, include 1 and 3

In [17]:
df.loc[1:3]

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4